// 47. Написать программу копирования массива
Console.WriteLine("Hello, World!");
